<!-- add-pr-comment:add-pr-comment -->

## dev plan
```
data.kubectl_path_documents.manifests: Reading...
data.kubectl_path_documents.manifests: Read complete after 0s [id=dfc0374129048492dced1c10b43f4f1f010303a7748843b2a2e480abcff3815e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.yandex_kubernetes_cluster.k8s-learn will be read during apply
  # (config refers to values not yet known)
 <= data "yandex_kubernetes_cluster" "k8s-learn" {
      + cluster_id               = (known after apply)
      + cluster_ipv4_range       = (known after apply)
      + cluster_ipv6_range       = (known after apply)
      + created_at               = (known after apply)
      + description              = (known after apply)
      + folder_id                = (known after apply)
      + health                   = (known after apply)
      + id                       = (known after apply)
      + kms_provider             = (known after apply)
      + labels                   = (known after apply)
      + log_group_id             = (known after apply)
      + master                   = (known after apply)
      + name                     = (known after apply)
      + network_id               = (known after apply)
      + network_implementation   = (known after apply)
      + network_policy_provider  = (known after apply)
      + node_ipv4_cidr_mask_size = (known after apply)
      + node_service_account_id  = (known after apply)
      + release_channel          = (known after apply)
      + service_account_id       = (known after apply)
      + service_ipv4_range       = (known after apply)
      + service_ipv6_range       = (known after apply)
      + status                   = (known after apply)
    }

  # data.yandex_vpc_address.ip-nlb-k8s-learn will be read during apply
  # (config refers to values not yet known)
 <= data "yandex_vpc_address" "ip-nlb-k8s-learn" {
      + address_id            = (known after apply)
      + created_at            = (known after apply)
      + description           = (known after apply)
      + external_ipv4_address = (known after apply)
      + folder_id             = (known after apply)
      + id                    = (known after apply)
      + labels                = (known after apply)
      + name                  = (known after apply)
      + reserved              = (known after apply)
      + used                  = (known after apply)
    }

  # helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + atomic                     = true
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 2
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.10.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + atomic                     = true
      + chart                      = "grafana"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 2
      + metadata                   = (known after apply)
      + name                       = "grafana"
      + namespace                  = "grafana"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ingress:
                  enabled: true
                  ingressClassName: nginx
                  annotations:
                    cert-manager.io/cluster-issuer: "letsencrypt"
                persistence:
                  enabled: true
                  storageClassName: "yc-network-hdd"
                  size: 10Gi
                sidecar:
                  datasources:
                    enabled: true
                  dashboards:
                    enabled: true
                  plugins:
                    enables: true
                datasources:
                  datasources.yaml:
                    apiVersion: 1
                    datasources:
                    - name: Prometheus
                      type: prometheus
                      url: http://prometheus-server.prometheus.svc.cluster.local
                      isDefault: true
                    - name: Loki
                      type: loki
                      url: http://loki-stack.loki-stack.svc.cluster.local:3100
                dashboardProviders:
                  dashboardproviders.yaml:
                    apiVersion: 1
                    providers:
                    - name: 'default'
                      orgId: 1
                      folder: ''
                      type: file
                      disableDeletion: false
                      editable: true
                      options:
                        path: /var/lib/grafana/dashboards/default
                plugins:
                  - digrich-bubblechart-panel
                  - grafana-clock-panel
                  - grafana-piechart-panel
            EOT,
          + <<-EOT
                dashboards:
                  default:
                    ingress-nginx:
                      gnetId: 9614
                      datasource: Prometheus
                    kubernetes-dashboard:
                      gnetId: 15661
                      datasource: Prometheus
                    ingress-nextgen:
                      gnetId: 14314
                      datasource: Prometheus
                    kubernetes-views:
                      gnetId: 14314
                      datasource: Prometheus
            EOT,
        ]
      + verify                     = false
      + version                    = "6.44.4"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "ingress.hosts[0]"
          + value = "grafana.services.dev.ya.l33t.wtf"
        }
      + set {
          + name  = "ingress.tls[0].hosts[0]"
          + value = "grafana.services.dev.ya.l33t.wtf"
        }
      + set {
          + name  = "ingress.tls[0].secretName"
          + value = "letsencrypt"
        }
    }

  # helm_release.ingress_nginx will be created
  + resource "helm_release" "ingress_nginx" {
      + atomic                     = true
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 2
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "ingress-nginx"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                controller:
                  # hostNetwork: true
                  # hostPort:
                  #   # -- Enable 'hostPort' or not
                  #   enabled: true
                  #   ports:
                  #     # -- 'hostPort' http port
                  #     http: 80
                  #     # -- 'hostPort' https port
                  #     https: 443
                  autoscaling:
                    enabled: true
                    minReplicas: 1
                    maxReplicas: 3
                    targetCPUUtilizationPercentage: 80
                    targetMemoryUtilizationPercentage: 80
                  service:
                    type: LoadBalancer
                    nodePorts:
                      http: 32080
                      https: 32443
                      tcp:
                        8080: 32808
                  metrics:
                    port: 10254
                    portName: metrics
                    # if this port is changed, change healthz-port: in extraArgs: accordingly
                    enabled: true
                    service:
                      annotations:
                        prometheus.io/scrape: "true"
                        prometheus.io/port: "10254"
            EOT,
        ]
      + verify                     = false
      + version                    = "4.4.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "controller.service.loadBalancerIP"
          + value = (known after apply)
        }
    }

  # helm_release.loki-stack will be created
  + resource "helm_release" "loki-stack" {
      + atomic                     = true
      + chart                      = "loki-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 2
      + metadata                   = (known after apply)
      + name                       = "loki-stack"
      + namespace                  = "loki-stack"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                loki:
                  enabled: true
                  persistence:
                    enabled: true
                    storageClassName: "yc-network-hdd"
                    size: 50Gi
                
                promtail:
                  enabled: true
                  pipelineStages:
                    - cri: {}
                    - json:
                      expressions:
                      is_even: is_even
                      level: level
                      version: version
            EOT,
        ]
      + verify                     = false
      + version                    = "2.8.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.prometheus will be created
  + resource "helm_release" "prometheus" {
      + atomic                     = true
      + chart                      = "prometheus"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 2
      + metadata                   = (known after apply)
      + name                       = "prometheus"
      + namespace                  = "prometheus"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                alertmanager:
                  ingress:
                    enabled: true
                    ingressClassName: nginx
                    annotations:
                      cert-manager.io/cluster-issuer: "letsencrypt"
                  persistentVolume:
                    storageClass: "yc-network-hdd"
                    size: 2Gi
                
                server:
                  global:
                    scrape_interval: 30s
                  ingress:
                    enabled: true
                    ingressClassName: nginx
                    annotations:
                      cert-manager.io/cluster-issuer: "letsencrypt"
                  persistentVolume:
                    storageClass: "yc-network-hdd"
                    size: 8Gi
                
                pushgateway:
                  ingress:
                    enabled: true
                    ingressClassName: nginx
                    annotations:
                      cert-manager.io/cluster-issuer: "letsencrypt"
                  persistentVolume:
                    storageClass: "yc-network-hdd"
                    size: 2Gi
            EOT,
        ]
      + verify                     = false
      + version                    = "15.17.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "alertmanager.ingress.hosts[0]"
          + value = "alertmanager.services.dev.ya.l33t.wtf"
        }
      + set {
          + name  = "pushgateway.ingress.hosts[0]"
          + value = "pushgateway.services.dev.ya.l33t.wtf"
        }
      + set {
          + name  = "server.ingress.hosts[0]"
          + value = "prometheus.services.dev.ya.l33t.wtf"
        }
    }

  # helm_release.testapp will be created
  + resource "helm_release" "testapp" {
      + atomic                     = false
      + chart                      = "test_chart/testapp"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 2
      + metadata                   = (known after apply)
      + name                       = "testapp"
      + namespace                  = "testapp"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "ingressHost"
          + value = "app.dev.ya.l33t.wtf"
        }
    }

  # kubectl_manifest.letsencrypt["apiVersion: cert-manager.io/v1\nkind: ClusterIssuer\nmetadata:\n  name: letsencrypt\n  namespace: cert-manager\nspec:\n  acme:\n    server: https://acme-v02.api.letsencrypt.org/directory\n    email: lawliet2012sven@gmail.com\n    privateKeySecretRef:\n      name: letsencrypt\n    solvers:\n    - http01:\n        ingress:\n          class: nginx"] will be created
  + resource "kubectl_manifest" "letsencrypt" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt
              namespace: cert-manager
            spec:
              acme:
                email: lawliet2012sven@gmail.com
                privateKeySecretRef:
                  name: letsencrypt
                server: https://acme-v02.api.letsencrypt.org/directory
                solvers:
                - http01:
                    ingress:
                      class: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # yandex_dns_recordset.alertmanager will be created
  + resource "yandex_dns_recordset" "alertmanager" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "alertmanager.services.dev.ya.l33t.wtf."
      + ttl     = 60
      + type    = "A"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.app will be created
  + resource "yandex_dns_recordset" "app" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "app.dev.ya.l33t.wtf."
      + ttl     = 60
      + type    = "A"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.grafana will be created
  + resource "yandex_dns_recordset" "grafana" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "grafana.services.dev.ya.l33t.wtf."
      + ttl     = 60
      + type    = "A"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.prometheus will be created
  + resource "yandex_dns_recordset" "prometheus" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "prometheus.services.dev.ya.l33t.wtf."
      + ttl     = 60
      + type    = "A"
      + zone_id = (known after apply)
    }

  # yandex_dns_recordset.pushgateway will be created
  + resource "yandex_dns_recordset" "pushgateway" {
      + data    = (known after apply)
      + id      = (known after apply)
      + name    = "pushgateway.services.dev.ya.l33t.wtf."
      + ttl     = 60
      + type    = "A"
      + zone_id = (known after apply)
    }

  # yandex_dns_zone.dns-k8s-learn will be created
  + resource "yandex_dns_zone" "dns-k8s-learn" {
      + created_at       = (known after apply)
      + folder_id        = (known after apply)
      + id               = (known after apply)
      + name             = "dns-dev"
      + private_networks = (known after apply)
      + public           = true
      + zone             = "dev.ya.l33t.wtf."
    }

  # yandex_iam_service_account.sa-k8s-learn will be created
  + resource "yandex_iam_service_account" "sa-k8s-learn" {
      + created_at  = (known after apply)
      + description = "K8S regional service account"
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + name        = "sa-k8s-learn-dev"
    }

  # yandex_kms_symmetric_key.kms-key will be created
  + resource "yandex_kms_symmetric_key" "kms-key" {
      + created_at        = (known after apply)
      + default_algorithm = "AES_128"
      + folder_id         = (known after apply)
      + id                = (known after apply)
      + name              = "kms-k8s-learn-dev"
      + rotated_at        = (known after apply)
      + rotation_period   = "8760h"
      + status            = (known after apply)
    }

  # yandex_kubernetes_cluster.k8s-learn-zone[0] will be created
  + resource "yandex_kubernetes_cluster" "k8s-learn-zone" {
      + cluster_ipv4_range       = (known after apply)
      + cluster_ipv6_range       = (known after apply)
      + created_at               = (known after apply)
      + description              = (known after apply)
      + folder_id                = (known after apply)
      + health                   = (known after apply)
      + id                       = (known after apply)
      + labels                   = (known after apply)
      + log_group_id             = (known after apply)
      + name                     = "k8s-learn-cluster-dev"
      + network_id               = (known after apply)
      + node_ipv4_cidr_mask_size = 24
      + node_service_account_id  = (known after apply)
      + release_channel          = (known after apply)
      + service_account_id       = (known after apply)
      + service_ipv4_range       = (known after apply)
      + service_ipv6_range       = (known after apply)
      + status                   = (known after apply)

      + kms_provider {
          + key_id = (known after apply)
        }

      + master {
          + cluster_ca_certificate = (known after apply)
          + external_v4_address    = (known after apply)
          + external_v4_endpoint   = (known after apply)
          + internal_v4_address    = (known after apply)
          + internal_v4_endpoint   = (known after apply)
          + public_ip              = true
          + security_group_ids     = (known after apply)
          + version                = "1.22"
          + version_info           = (known after apply)

          + maintenance_policy {
              + auto_upgrade = (known after apply)

              + maintenance_window {
                  + day        = (known after apply)
                  + duration   = (known after apply)
                  + start_time = (known after apply)
                }
            }

          + regional {
              + region = (known after apply)

              + location {
                  + subnet_id = (known after apply)
                  + zone      = (known after apply)
                }
            }

          + zonal {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-a"
            }
        }
    }

  # yandex_kubernetes_node_group.ng-k8s-learn-zone[0] will be created
  + resource "yandex_kubernetes_node_group" "ng-k8s-learn-zone" {
      + cluster_id        = (known after apply)
      + created_at        = (known after apply)
      + description       = "Node group for k8s-learn cluster"
      + id                = (known after apply)
      + instance_group_id = (known after apply)
      + labels            = (known after apply)
      + name              = "ng-k8s-learn-dev"
      + status            = (known after apply)
      + version           = "1.22"
      + version_info      = (known after apply)

      + allocation_policy {
          + location {
              + subnet_id = (known after apply)
              + zone      = "ru-central1-a"
            }
        }

      + deploy_policy {
          + max_expansion   = (known after apply)
          + max_unavailable = (known after apply)
        }

      + instance_template {
          + metadata                  = (known after apply)
          + nat                       = (known after apply)
          + network_acceleration_type = (known after apply)
          + platform_id               = "standard-v2"

          + boot_disk {
              + size = 32
              + type = "network-hdd"
            }

          + container_runtime {
              + type = "containerd"
            }

          + network_interface {
              + ipv4               = true
              + ipv6               = (known after apply)
              + nat                = true
              + security_group_ids = (known after apply)
              + subnet_ids         = (known after apply)
            }

          + resources {
              + core_fraction = (known after apply)
              + cores         = 2
              + gpus          = 0
              + memory        = 4
            }

          + scheduling_policy {
              + preemptible = false
            }
        }

      + maintenance_policy {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + scale_policy {

          + fixed_scale {
              + size = 3
            }
        }
    }

  # yandex_resourcemanager_folder.k8s-learn will be created
  + resource "yandex_resourcemanager_folder" "k8s-learn" {
      + cloud_id   = "b1gssi7qdb50avtuo2kr"
      + created_at = (known after apply)
      + id         = (known after apply)
      + name       = "k8s-learn-dev"
    }

  # yandex_resourcemanager_folder_iam_binding.alb-editor will be created
  + resource "yandex_resourcemanager_folder_iam_binding" "alb-editor" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "alb.editor"
    }

  # yandex_resourcemanager_folder_iam_binding.certificate-downloader will be created
  + resource "yandex_resourcemanager_folder_iam_binding" "certificate-downloader" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "certificate-manager.certificates.downloader"
    }

  # yandex_resourcemanager_folder_iam_binding.compute-viewer will be created
  + resource "yandex_resourcemanager_folder_iam_binding" "compute-viewer" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "compute.viewer"
    }

  # yandex_resourcemanager_folder_iam_binding.editor will be created
  + resource "yandex_resourcemanager_folder_iam_binding" "editor" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "editor"
    }

  # yandex_resourcemanager_folder_iam_binding.images-puller will be created
  + resource "yandex_resourcemanager_folder_iam_binding" "images-puller" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "container-registry.images.puller"
    }

  # yandex_resourcemanager_folder_iam_binding.k8s-admin will be created
  + resource "yandex_resourcemanager_folder_iam_binding" "k8s-admin" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "k8s.admin"
    }

  # yandex_resourcemanager_folder_iam_binding.nlb-admin will be created
  + resource "yandex_resourcemanager_folder_iam_binding" "nlb-admin" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "load-balancer.admin"
    }

  # yandex_resourcemanager_folder_iam_binding.vpc-admin will be created
  + resource "yandex_resourcemanager_folder_iam_binding" "vpc-admin" {
      + folder_id = (known after apply)
      + id        = (known after apply)
      + members   = (known after apply)
      + role      = "vpc.admin"
    }

  # yandex_vpc_address.ip-nlb-k8s-learn will be created
  + resource "yandex_vpc_address" "ip-nlb-k8s-learn" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "ip-nlb-k8s-learn-dev"
      + reserved   = (known after apply)
      + used       = (known after apply)

      + external_ipv4_address {
          + address                  = (known after apply)
          + ddos_protection_provider = (known after apply)
          + outgoing_smtp_capability = (known after apply)
          + zone_id                  = "ru-central1-a"
        }
    }

  # yandex_vpc_network.vpc-k8s-learn will be created
  + resource "yandex_vpc_network" "vpc-k8s-learn" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "vpc-k8s-learn-dev"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_security_group.sg-k8s-learn will be created
  + resource "yandex_vpc_security_group" "sg-k8s-learn" {
      + created_at  = (known after apply)
      + description = "Правила группы обеспечивают базовую работоспособность кластера. Примените ее к кластеру и группам узлов."
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = "sg-k8s-learn-dev"
      + network_id  = (known after apply)
      + status      = (known after apply)

      + egress {
          + description    = "Правило разрешает весь исходящий трафик. Узлы могут связаться с Yandex Container Registry, Yandex Object Storage, Docker Hub и т. д."
          + from_port      = 0
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = -1
          + protocol       = "ANY"
          + to_port        = 65535
          + v4_cidr_blocks = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks = []
        }

      + ingress {
          + description    = "Allow NLB 443"
          + from_port      = -1
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = 32443
          + protocol       = "TCP"
          + to_port        = -1
          + v4_cidr_blocks = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks = []
        }
      + ingress {
          + description    = "Allow NLB 80"
          + from_port      = -1
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = 32080
          + protocol       = "TCP"
          + to_port        = -1
          + v4_cidr_blocks = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks = []
        }
      + ingress {
          + description    = "Allow all"
          + from_port      = 0
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = -1
          + protocol       = "TCP"
          + to_port        = 65535
          + v4_cidr_blocks = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks = []
        }
      + ingress {
          + description       = "Правило разрешает взаимодействие мастер-узел и узел-узел внутри группы безопасности."
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "self_security_group"
          + protocol          = "ANY"
          + to_port           = 65535
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
        }
      + ingress {
          + description    = "Правило разрешает взаимодействие под-под и сервис-сервис. Укажите подсети вашего кластера и сервисов."
          + from_port      = 0
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = -1
          + protocol       = "ANY"
          + to_port        = 65535
          + v4_cidr_blocks = [
              + "10.129.0.0/24",
            ]
          + v6_cidr_blocks = []
        }
      + ingress {
          + description    = "Правило разрешает доступ к кластеру из нижеуказанных подсетей."
          + from_port      = 0
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = -1
          + protocol       = "TCP"
          + to_port        = 65535
          + v4_cidr_blocks = [
              + "95.82.72.171/32",
            ]
          + v6_cidr_blocks = []
        }
      + ingress {
          + description    = "Правило разрешает отладочные ICMP-пакеты из внутренних подсетей."
          + from_port      = -1
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = -1
          + protocol       = "ICMP"
          + to_port        = -1
          + v4_cidr_blocks = [
              + "172.16.0.0/12",
            ]
          + v6_cidr_blocks = []
        }
      + ingress {
          + description    = "Правило разрешает проверки доступности с диапазона адресов балансировщика нагрузки. Нужно для работы отказоустойчивого кластера и сервисов балансировщика."
          + from_port      = 0
          + id             = (known after apply)
          + labels         = (known after apply)
          + port           = -1
          + protocol       = "TCP"
          + to_port        = 65535
          + v4_cidr_blocks = [
              + "198.18.235.0/24",
              + "198.18.248.0/24",
            ]
          + v6_cidr_blocks = []
        }
    }

  # yandex_vpc_subnet.net-k8s-learn-a will be created
  + resource "yandex_vpc_subnet" "net-k8s-learn-a" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = (known after apply)
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "10.5.0.0/16",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

Plan: 30 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```